[{"model": "products.product", "pk": 175, "fields": {"category": 14, "sku": "mb419167", "name": "Adidas Predator Freak +FG", "description": "Give yourself the chance to be a game changer, a game winner and unleash your full force with the Predator Freak + football boots by adidas. The boots have been engineered with a Primeknit upper which wraps your foot from heel to toe for adaptive support, while the laceless striking zone and extensive Demonskin 2.0 technology delivers optimal ball control. They have a two-piece engineered sock construction which allows you to slip in and out the boos with ease and the specially designed outsole with moulded studs maximise traction so you can reach your peak every time you stand on the pitch.", "has_sizes": true, "price": "230.00", "rating": null, "image_url": null, "image": "Adidas_Predator_Freak_FG.webp"}}, {"model": "products.product", "pk": 176, "fields": {"category": 14, "sku": "mb563437", "name": "Nike Phantom GT Elite DF FG Football Boots", "description": "These Phantom GT Elite Football Boots have been developed with a Dynamic Fit collar which delivers a snug, comfortable and supportive fit around the ankle. The boots benefit from having texturing across the upper which is thicker and denser at the instep and toe for superior control and accuracy, while the Flyknit construction provides a close-to-the-ball feel with the support to weave around players with ease. The All Conditions Control (ACC) technology ensures you get a reliable touch in wet and dry conditions and the Hyperquick system combines a finely-tuned chassis with an open-arch plate for lightweight stability", "has_sizes": true, "price": "165.00", "rating": null, "image_url": null, "image": "Nike_Phantom_GT_Elite_DF_FG_Football_Boots.webp"}}, {"model": "products.product", "pk": 177, "fields": {"category": 14, "sku": "mb433492", "name": "Puma Ultra 1.2 FG Football Boots", "description": "These Puma Ultra 1.2 FG Football Boots have been engineered with a Pebax SpeedUnit outsole which has been inspired by running spikes for rapid acceleration, while the GripControl Pro coating boosts your first touch for decisive command over the ball. The boots have a lightweight MATRYXEVO woven upper which has been constructed with reactive Kevlar and Carbon yarns for essential support, while the removable sockliner with Nano Grip technology helps lock the foot in place and the moulded studs give you the traction needed to succeed on firm ground surfaces.", "has_sizes": true, "price": "180.00", "rating": null, "image_url": null, "image": "Puma_Ultra_1.2_FG_Football_Boots.webp"}}, {"model": "products.product", "pk": 178, "fields": {"category": 14, "sku": "mb258746", "name": "Diadora B-Elite Italia Leather FG - Gold/White", "description": "Experience truly premium performance with Diadora Brasil Made In Italy B Elite Leather FG football boots in Gold/White, made in Italy from the finest leather for a super-soft feel and a pristine first touch.\r\n\r\nUshering in a new generation of comfort, the Diadora Brasil Made In Italy B Elite Leather FG takes the best bits of 90s Diadora boots – the plush feel and forgiving shape – and combines them with a modern, lightweight soleplate designed for agile movement.", "has_sizes": true, "price": "230.00", "rating": null, "image_url": null, "image": "Diadora_B-Elite_Italia_Leather_FG_-_GoldWhite.webp"}}, {"model": "products.product", "pk": 179, "fields": {"category": 14, "sku": "mb346810", "name": "New Balance Furon V5 Destroy FG", "description": "Check out the absolutely unstoppable force of Furon. Re-imagined and re-energised with an enhanced FantomFit frame, a four-way stretch tongue and bonded leather upper to support target areas whilst not compromising on the lightweight, mechanical lockdown of the shoe. The Furon v5 has evolved with a straight last and a lower toe spring for superior fit, a sprint spike-inspired sole-plate and a directional stud placement for an explosive performance on firm pitches. Do not miss out on this.", "has_sizes": true, "price": "80.00", "rating": null, "image_url": null, "image": "New_Balance_Furon_V5_Destroy_FG.webp"}}, {"model": "products.product", "pk": 180, "fields": {"category": 15, "sku": "mg652340", "name": "adidas Pre Match Jacket Mens", "description": "This adidas Sereno Track Jacket is crafted with full zip fastening and long sleeves. It features ribbed trims for a comfortable fit and is a 2 pocket design. This jacket is a lightweight construction designed with a printed logo and is complete with adidas branding.", "has_sizes": true, "price": "30.00", "rating": null, "image_url": null, "image": "adidas_Pre_Match_Jacket_Mens.jpg"}}, {"model": "products.product", "pk": 181, "fields": {"category": 15, "sku": "mg361259", "name": "Puma NXT T Shirt Mens", "description": "This Puma NXT T Shirt is crafted with short sleeves and a crew neck for a classic look. It features flat lock seams to prevent chafing and is a lightweight construction. This t shirt is designed with a signature logo and is complete with Puma branding.", "has_sizes": true, "price": "14.00", "rating": null, "image_url": "https://tomod24-get-booted.s3.amazonaws.com/media/Puma_NXT_T_Shirt_Mens.jpg", "image": "Puma_NXT_T_Shirt_Mens.jpg"}}, {"model": "products.product", "pk": 182, "fields": {"category": 15, "sku": "mg583621", "name": "Nike Academy Woven Tracksuit Mens", "description": "This Nike Academy Woven Tracksuit consists of a jacket and joggers. The jacket is crafted with full zip fastening, long sleeves and 2 pockets. The joggers feature an elasticated waist, drawstring fastening and 2 pockets. Both pieces in this set are designed with a signature logo and are complete with Nike Swoosh branding.", "has_sizes": true, "price": "42.00", "rating": null, "image_url": null, "image": "Nike_Academy_Woven_Tracksuit_Mens.jpg"}}, {"model": "products.product", "pk": 183, "fields": {"category": 15, "sku": "mg544948", "name": "Nike Strike Snood Adults", "description": "The Nike Strike Snood is perfect for training sessions or everyday wear, featuring a lightweight fleece construction with flat lock seams for a warm and comfortable fit, completed with the Nike Swoosh branding.", "has_sizes": true, "price": "14.00", "rating": null, "image_url": null, "image": "Nike_Strike_Snood_Adults.jpg"}}, {"model": "products.product", "pk": 184, "fields": {"category": 15, "sku": "mg277401", "name": "adidas Sereno Track Jacket Mens", "description": "This adidas Sereno Track Jacket is crafted with full zip fastening and long sleeves. It features ribbed trims for a comfortable fit and is a 2 pocket design. This jacket is a lightweight construction designed with a printed logo and is complete with adidas branding.", "has_sizes": true, "price": "27.00", "rating": null, "image_url": null, "image": "adidas_Sereno_Track_Jacket_Mens.jpg"}}, {"model": "products.product", "pk": 185, "fields": {"category": 2, "sku": "wb454123", "name": "Under Armour Speedform CRM L FG", "description": "The Under Armour Speedform Leather FG has an innovative, single-piece UA SpeedForm® upper with an articulated toe box that moulds perfectly to your foot, to offer reliable performance on the pitch. The brand new Under Armour Speedform Leather FG are worn by Manchester United's Dutch midfielder, Memphis Depay.", "has_sizes": true, "price": "45.00", "rating": null, "image_url": null, "image": "Under_Armour_Speedform_CRM_L_FG.webp"}}, {"model": "products.product", "pk": 186, "fields": {"category": 2, "sku": "wb549210", "name": "Nike Mercurial Superfly VII Elite FG Mbappé x Lebron", "description": "Decked out with signature details from both athletes, the boots combine basketball and soccer influences to create a one-off look.\r\n\r\nLeBron’s logo sits on the left heel, Kylian’s on the right, while mirrored double-Swooshes adorn the midfoot of the super-sleek upper.\r\n\r\nThe Nike Mercurial Superfly VII Elite football boots build on the 360 innovation of the VI, but with new added features to enhance fit, responsiveness on the pitch, and feel even lighter on foot.\r\n\r\nLighter and stronger than the materials used on the previous version, the Flyknit upper on this Mercurial Superfly is constructed from a high-tenacity yarn. The result is an upper that’s extremely lightweight and supremely soft, helping to reduce break-in time as the yarn wraps around the foot for a true one-to-one fit.\r\n \r\nCreated to produce a 3D micro texture on the upper for increased feel on the ball, the Flyknit is applied with the thinnest application of NIKESKIN to date. Providing the Mercurial player with minimal distraction between the foot and ball while travelling at high speeds for precise control. To enable consistent levels of feel and touch in either dry or wet weather conditions, a coating of All Conditions Control (ACC) is applied to the NIKESKIN.\r\n \r\nRedesigned to further improve fit around the ankle, the Dynamic Fit Collar has a new shape that slopes from the back to front. For added comfort, the perforations around the heel have been redesigned to increase lockdown, while the internal lining that wraps around your foot has been perforated to provide breathability like no other Mercurial before.", "has_sizes": true, "price": "250.00", "rating": null, "image_url": null, "image": "Nike_Mercurial_Superfly_VII_Elite_FG_Mbappé_x_Lebron.webp"}}, {"model": "products.product", "pk": 187, "fields": {"category": 2, "sku": "wb129340", "name": "Concave Aura+ FG", "description": "Engineered to ensure your control is perfect, the Concave Aura+ FG football boots allow you to dictate the speed of play on firm ground thanks to the sublime touch of the soft, a-grade kangaroo leather.", "has_sizes": true, "price": "60.00", "rating": null, "image_url": null, "image": "Concave_Aura_FG.webp"}}, {"model": "products.product", "pk": 188, "fields": {"category": 2, "sku": "wb746374", "name": "adidas Predator Mutator+ FG", "description": "Show no mercy, feel no remorse and push the rules to the limit in the adidas Predator Mutator+ FG football boots in Signal Green/White/Core Black, which have an innovative Demonskin treatment to deliver unrivalled bend on the ball and total control all over the pitch.", "has_sizes": true, "price": "170.00", "rating": null, "image_url": null, "image": "adidas_Predator_Mutator_FG.webp"}}, {"model": "products.product", "pk": 189, "fields": {"category": 2, "sku": "wb948328", "name": "Mizuno Morelia Neo 3 ß Made In Japan FG", "description": "Race past your rivals in Mizuno Morelia Neo 3 β Made In Japan FG football boots in Black/Blue Atoll, featuring a lightweight, streamlined design that’s refined for absolute speed.\r\n\r\nThe third-generation Neo features an updated shape with a taller toebox, and, as always, the flagship “Made in Japan” edition has been lasted for 24 hours to offer the best possible fit.", "has_sizes": true, "price": "275.00", "rating": null, "image_url": null, "image": "Mizuno_Morelia_Neo_3_ß_Made_In_Japan_FG.webp"}}, {"model": "products.product", "pk": 190, "fields": {"category": 18, "sku": "wg544367", "name": "Nike Sportswear Womens Swoosh Crew Fleece", "description": "The Nike Swoosh Fleece crew brings timeless style to the street with soft fleece fabric and a huge Swoosh on the front.", "has_sizes": true, "price": "50.00", "rating": null, "image_url": null, "image": "Nike_Sportswear_Womens_Swoosh_Crew_Fleece.jpg"}}, {"model": "products.product", "pk": 191, "fields": {"category": 18, "sku": "wg328848", "name": "Jordan Legend Crew 6 Pack - Multi", "description": "Keep young feet cozy with the Jordan Legend Crew 6 Pack, featuring stretchy and breathable materials for all-day comfort.", "has_sizes": true, "price": "18.00", "rating": null, "image_url": null, "image": "Jordan_Legend_Crew_6_Pack_-_Multi.webp"}}, {"model": "products.product", "pk": 192, "fields": {"category": 18, "sku": "wg837274", "name": "Nike Womens Sportswear Icon Clash Hoodie 1/4 Zip", "description": "Dark Raisin/Crimson Bliss/Bright Mango", "has_sizes": false, "price": "68.00", "rating": null, "image_url": null, "image": "Nike_Womens_Sportswear_Icon_Clash_Hoodie_14_Zip.jpg"}}, {"model": "products.product", "pk": 193, "fields": {"category": 18, "sku": "wg321897", "name": "Nike Womens Sportswear SSNL Bucket Hat", "description": "Black/Black/White", "has_sizes": false, "price": "23.00", "rating": null, "image_url": null, "image": "Nike_Womens_Sportswear_SSNL_Bucket_Hat.jpg"}}, {"model": "products.product", "pk": 194, "fields": {"category": 18, "sku": "wg543893", "name": "Nike Sportswear Air Max 270", "description": "Updated for modern comfort, the Nike Sportswear Air Max 270 in Black, Metallic Silver and Total Orange nods to the original 180 with its exaggerated tongue top and heritage tongue logo.", "has_sizes": true, "price": "120.00", "rating": null, "image_url": null, "image": "Nike_Sportswear_Air_Max_270.webp"}}, {"model": "products.product", "pk": 195, "fields": {"category": 11, "sku": "kb437839", "name": "adidas Kids X 19.3 Laceless FG", "description": "Designed to maximise your speed and control, the adidas Kids' X 19.3 FG football boots feature a thin dual layer mesh upper, developed for a true touch and lightweight material feel when performing high speed movements.\r\n\r\nGetting you closer to the action, the laceless construction eliminates any distraction, helping to provide clean contact when striking the ball.\r\n\r\nThe low-cut silhouette of the signature Clawcollar locks your foot into the boot for superior support and stability when changing direction.\r\n\r\nDesigned for use on firm natural ground surfaces, the arrowhead shaped studs on the forefoot of the soleplate are specifically engineered to enable quick change of direction with control.", "has_sizes": true, "price": "25.00", "rating": null, "image_url": null, "image": "adidas_Kids_X_19.3_Laceless_FG.webp"}}, {"model": "products.product", "pk": 196, "fields": {"category": 11, "sku": "kb459392", "name": "adidas Kids Predator 20.3 Laceless TF", "description": "Show no mercy, feel no remorse and push the rules to the limit in the adidas Kids' Predator 20.3 Laceless TF football shoes which have Demonscale on the upper to deliver extra bend on the ball and total control all over the pitch.", "has_sizes": true, "price": "27.00", "rating": null, "image_url": null, "image": "adidas_Kids_Predator_20.3_Laceless_TF.webp"}}, {"model": "products.product", "pk": 197, "fields": {"category": 11, "sku": "kb646224", "name": "adidas Kids Predator Freak .1 FG", "description": "Unleash your full force of nature wearing adidas Kids Predator Freak .1 FG football boots in Blue/Core Black/White/Solar Yellow, featuring Demonskin 2.0 spines for devastating control and ball striking.\r\n\r\nWith Demonskin 2.0 spines covering almost the entirety of the mid- and forefoot, the adidas Predator Freak .1 ups the intimidation factor in both looks and performance.\r\n\r\nThe spines are styled to be even more aggressive, producing outrageous dip and swerve on shots in addition to first-class control when receiving the ball and dribbling.\r\n\r\nFor comfort and convenience, the Pred’s knitted upper now features a two-piece, easy-entry collar, with the higher back section acting as a guide to allow your foot to slide in. No messing about – boots on, ready to play. Exactly what you want.\r\n\r\nUnderfoot, the soleplate boasts a hybrid stud pattern for quick movement in all directions, ensuring stability and traction as you dominate the pitch.", "has_sizes": true, "price": "85.00", "rating": null, "image_url": null, "image": "adidas_Kids_Predator_Freak_.1_FG.webp"}}, {"model": "products.product", "pk": 198, "fields": {"category": 11, "sku": "kb210294", "name": "Nike Kids Phantom GT Academy AG", "description": "Run the game wearing Nike Kids Phantom GT Academy AG football boots in Wolf Grey/Metallic Silver/Black, featuring a grippy texture on the upper for enhanced touch and precision ball-striking.\r\n\r\nBack in 2002, Nike pitted eight formidable trios against each other in the Secret Tournament, as the world’s greatest players threw down to see who would be crowned the kings of the cage. Inspired by the iconic ad campaign, this special edition Phantom GT features an aggressive geometric pattern along with Scorpion branding on the upper and insole.\r\n\r\nWith a Generative Texture across the upper of the boot, the Nike Kids Phantom GT Academy AG gives you ultimate control in any situation. Thicker and denser at the instep and toe, the grippy texturing improves your touch when receiving the ball and allows greater precision as you ping a pass to your teammate or fire a shot into the top corner.\r\n\r\nFor dribbling, the Phantom GT’s extra grip combines with a synthetic leather construction to give you better feel on the ball and a secure, comfortable fit. Underfoot, a lightweight soleplate with an agility-focused stud configuration provides dynamic traction on artificial grass surfaces.", "has_sizes": true, "price": "40.00", "rating": null, "image_url": "https://tomod24-get-booted.s3.amazonaws.com/media/Puma_NXT_T_Shirt_Mens.jpg", "image": "Nike_Kids_Phantom_GT_Academy_AG.jpg"}}, {"model": "products.product", "pk": 199, "fields": {"category": 11, "sku": "kb783738", "name": "Nike Kids Dream Speed Mercurial Superfly VII Academy TF", "description": "Accelerate your dreams with Nike Kids Dream Speed Mercurial Superfly VII Academy TF football trainers in White/White/Black, featuring a super-fast design inspired by CR7 special edition colourways and the wider Mercurial archive.", "has_sizes": true, "price": "45.00", "rating": null, "image_url": null, "image": "Nike_Kids_Dream_Speed_Mercurial_Superfly_VII_Academy_TF.webp"}}, {"model": "products.product", "pk": 200, "fields": {"category": 12, "sku": "kg234509", "name": "Nike Kids Sportswear Hoodie Uni", "description": "Stay warm in cold weather with the Nike Kids Sportswear Hoodie, featuring French terry fabrics and recycled materials.", "has_sizes": true, "price": "55.00", "rating": null, "image_url": null, "image": "Nike_Kids_Sportswear_Hoodie.jpg"}}, {"model": "products.product", "pk": 201, "fields": {"category": 12, "sku": "kg537889", "name": "Nike France 2020 Kids Tee Evergreen Crest", "description": "Show your pride and support with the Nike France 2020 Kids Tee Evergreen Crest featuring soft cotton fabrics to help you stay comfy wherever you are.", "has_sizes": true, "price": "17.00", "rating": null, "image_url": null, "image": "Nike_France_2020_Kids_Tee_Evergreen_Crest.webp"}}, {"model": "products.product", "pk": 202, "fields": {"category": 12, "sku": "kgb394203", "name": "Nike Boys Air Zip Hoodie", "description": "Embrace casual comfort in the Nike Air full-zip hoodie.", "has_sizes": true, "price": "40.00", "rating": null, "image_url": null, "image": "Nike_Boys_Air_Zip_Hoodie.jpg"}}, {"model": "products.product", "pk": 203, "fields": {"category": 12, "sku": "kgg284839", "name": "Nike Girls Jacket", "description": "Embrace ultimate style in the Nike Windrunner floral Windbreaker.\r\n\r\nThe Nike Windrunner Floral Windbreaker features water-repellent ripstop fabric to keep your safe from the elements in style.", "has_sizes": true, "price": "55.00", "rating": null, "image_url": null, "image": "Nike_Girls_Jacket.webp"}}, {"model": "products.product", "pk": 204, "fields": {"category": 12, "sku": "kgg532326", "name": "Nike Sportswear Girls Tech Fleece Pant", "description": "The girl's Nike Tech Fleece Pant delivers warmth without the weight.\r\n\r\nComfort meets contemporary style with the Girls' Nike Sportswear Tech Fleece Pant. Crafted from textured Nike Tech Fleece fabric, it uses modern details like tapered legs, ribbed cuffs and bonded accents for an elevated look.", "has_sizes": true, "price": "36.00", "rating": null, "image_url": null, "image": "Nike_Sportswear_Girls_Tech_Fleece_Pant.jpg"}}]